<details ><summary>Digger run report at 2026-02-08 02:03:17 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # render_static_site.site will be created
  + resource "render_static_site" "site" {
      + auto_deploy                   = true
      + branch                        = "main"
      + build_command                 = "echo 'Static site - no build needed'"
      + id                            = (known after apply)
      + name                          = "digger-opentaco-oras-example"
      + notification_override         = (known after apply)
      + previews                      = (known after apply)
      + publish_path                  = "public"
      + pull_request_previews_enabled = (known after apply)
      + repo_url                      = "https://github.com/kvokka/opentaco-with-github-storage-example"
      + root_directory                = (known after apply)
      + slug                          = (known after apply)
      + url                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ site_url = "https://opentaco-demo.onrender.com" -> (known after apply)
render_static_site.site: Creating...
render_static_site.site: Creation complete after 3s [id=srv-d63utrchg0os73cqfiv0]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

site_url = "https://digger-opentaco-oras-example.onrender.com"

```
</details>
</details>